2412/tutorials/combustion/fireFoam/LES/simplePMMApanel/constant/panelRegion/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  opaqueSolid;

absorptionEmissionModel greyMeanSolidAbsorptionEmission;

greyMeanSolidAbsorptionEmissionCoeffs
{
    PMMA
    {
        absorptivity    0.17;
        emissivity      0.17;
    }
}

scatterModel    none;


// ************************************************************************* //
